import { IQuestion } from "@/types/types";

export const data: IQuestion[] = [
  {
    title: "Какой рост у Хаги Ваги?",
    variants: ["1 метр.", "2 метра.", "3 метра.", "4 метра."],
    correct: "3",
    image: "img/img1.jpg",
  },

  {
    title: "Как зовут женскую версию Хаги Ваги?",
    variants: ["Муси Пуси.", "Куси Туси.", "Киси Миси.", "Попи Топи."],
    correct: "3",
    image: "img/img2.jpg",
  },

  {
    title: "Сколько лет Хаги Ваги?",
    variants: ["64.", "55.", "46.", "37."],
    correct: "4",
    image: "img/img3.jpg",
  },

  {
    title: "Киси Миси и  Хаги Ваги это...?",
    variants: [
      "Муж и жена.",
      "Брат и сестра.",
      "Просто друзья.",
      "Они не знакомы.",
    ],
    correct: "1",
    image: "img/img4.jpg",
  },

  {
    title: "Хаги Ваги это игрушка для ..?",
    variants: ["Танцев.", "Обнимашек.", "Целований.", "Разговоров."],
    correct: "2",
    image: "img/img5.jpg",
  },

  {
    title: "Как зовут эту куклу?",
    variants: ["Паппи.", "Поппи.", "Пуппи.", "Пиппи."],
    correct: "2",
    image: "img/img6.jpg",
  },

  {
    title: "Как называется фабрика игрушек?",
    variants: [
      "Poppytime Co.",
      "Playertime Co.",
      "Playtime Co.",
      "Plartime Co.",
    ],
    correct: "3",
    image: "img/img7.jpg",
  },

  {
    title: "Какое кодовое слово у есть Хаги Ваги?",
    variants: [
      "Exp.  1-0-0-9.",
      "Exp.  1-0-0-8.",
      "Exp.  1-0-0-7.",
      "Exp.  1-0-0-6.",
    ],
    correct: "4",
    image: "img/img8.jpg",
  },

  {
    title: "Как Хаги Ваги убивает свою жертву?",
    variants: [
      "Обнимает до смерти.",
      "Целует.",
      "Загрызает.",
      "Разрывает на куски.",
    ],
    correct: "1",
    image: "img/img9.jpg",
  },

  {
    title: "Какого цвета правая рука рюкзака хватателя?",
    variants: ["Зеленая.", "Синяя.", "Красная.", "Желтая."],
    correct: "3",
    image: "img/img10.jpg",
  },

  {
    title: "Кто такой Хаги Ваги?",
    variants: [
      "Аниматроник.",
      "Животное.",
      "Человек внутри игрушки.",
      "Неизвестно существо.",
    ],
    correct: "3",
    image: "img/img11.jpg",
  },

  {
    title: "О чем просили игрока в отправленном ему письме?",
    variants: [
      "Уничтоживать Хаги Ваги.",
      "Найти цветок.",
      "Спастись.",
      "Подружться с ним.",
    ],
    correct: "1",
    image: "img/img12.jpg",
  },

  {
    title: "Какая кукла была самой подавленной?",
    variants: ["Вики.", "Джени.", "Хики.", "Нани."],
    correct: "4",
    image: "img/img13.jpg",
  },

  {
    title: "Кто основатель этой компании?",
    variants: ["Лейт Пьер.", "Тонни Ниер.", "Ферридо Тиер.", "Элиио Людвиг."],
    correct: "2",
    image: "img/img14.jpg",
  },

  {
    title: "Откуда игрок чирпает информацию?",
    variants: ["Из писем.", "Из головы.", "Из видео кассет.", "Из рисунков."],
    correct: "1",
    image: "img/img15.jpg",
  },
];
